app/views/users/show.html.erb

          </thread>
          <% @user.books.each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]