app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
def index
  @book = Book.new
  @books = Book.page(params[:page]).reverse_order

INSERT INTO "books" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-09-18 05:36:45.522311"], ["updated_at", "2018-09-18 05:36:45.522311"], ["title", "aba"], ["body", "aba"], ["user_id", 1]]
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
def create
  @book = Book.new(book_params)
  @book.user_id = current_user.id
  if @book.save
    redirect_to book_path(@book.id), notice: "Book was successfully created."
  else
    @books = Book.page(params[:page]).reverse_order

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "mmmmmmmm"], ["updated_at", "2018-09-17 12:49:33.110169"], ["id", 9]]
---
def update
  book = Book.find(params[:id])
  book.update(book_params)