app/controllers/users_controller.rb

  def index
  	@book = Book.new
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @book = Book.new
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "廣重"], ["introduction", "aueokakikukeko"], ["profile_image_id", nil], ["updated_at", "2018-09-17 10:50:37.123890"], ["id", 1]]